usound-tech/helike/HELIKE_STM32H750.ioc
#MicroXplorer Configuration settings - do not modify
PD7.Mode=SD_4_bits_Wide_bus
PC7.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
PA15\ (JTDI).GPIOParameters=GPIO_Label
Dma.UART5_TX.3.MemDataAlignment=DMA_MDATAALIGN_BYTE
USART2.IPParameters=VirtualMode-Asynchronous
FATFS._USE_LFN=3
PE11.GPIOParameters=GPIO_PuPd,GPIO_Label
Dma.SAI3_A.0.Polarity=HAL_DMAMUX_REQ_GEN_RISING
FATFS0.BSP.api=Unknown
Dma.SAI2_A.6.EventEnable=DISABLE
Dma.SAI3_A.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
PC7.Locked=true
RCC.PLLFRACN=1024
Dma.UART5_TX.3.SyncEnable=DISABLE
RCC.RTCFreq_Value=32000
PE10.GPIO_PuPd=GPIO_PULLUP
PA15\ (JTDI).Signal=GPIO_Input
RCC.CpuClockFreq_Value=480000000
PD2.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
NVIC.I2C4_EV_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
Dma.USART2_TX.5.Polarity=HAL_DMAMUX_REQ_GEN_RISING
RCC.LPTIM1Freq_Value=120000000
SH.GPXTI7.ConfNb=1
Dma.SAI2_A.6.SyncRequestNumber=1
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false
PE13.GPIO_Mode=GPIO_MODE_INPUT
Dma.USART2_TX.5.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
FREERTOS.configENABLE_FPU=1
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_ENABLE
SAI3.ErrorAudioFreq-SAI_A_MasterWithClock=0.0 %
PC13.GPIO_Mode=GPIO_MODE_INPUT
Dma.SAI3_A.0.Direction=DMA_MEMORY_TO_PERIPH
SDMMC2.IPParameters=ClockDiv
RCC.I2C4Freq_Value=120000000
PB6.Signal=I2C4_SCL
Dma.SAI2_A.6.SignalID=NONE
PC7.Signal=GPIO_Input
SAI2.SlotNumber-SAI_A_AsyncSlave=2
PD0.Signal=SAI3_SCK_A
Dma.UART5_RX.2.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
PE1.Signal=GPIO_Input
FATFS0.BSP.ip=GPIO
PE14.Locked=true
NVIC.EXTI15_10_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
ProjectManager.ProjectBuild=false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PA8.Locked=true
Dma.SAI3_B.1.SyncSignalID=NONE
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.7.0
ProjectManager.BackupPrevious=false
RCC.FMCFreq_Value=240000000
PC4.GPIO_Label=nAMP2_Powerdown
PB1.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PE9.Signal=GPXTI9
PE9.Locked=true
PB14.Mode=SD_4_bits_Wide_bus
PB1.GPIO_Label=nDAC2_Powerdown
RCC.USART16Freq_Value=120000000
PE4.GPIO_Label=LED3
SAI3.DataSize-SAI_B_SyncSlave=SAI_DATASIZE_16
PA8.Signal=GPIO_Input
PD14.GPIO_PuPd=GPIO_PULLUP
PE1.Locked=true
ProjectManager.HalAssertFull=false
RCC.DIVP2Freq_Value=61440000
Dma.UART5_TX.3.SyncRequestNumber=1
SAI3.VirtualMode-SAI_B_SyncSlave=VM_SLAVE
Dma.USART2_TX.5.Mode=DMA_NORMAL
PD15.Mode=SAI_A_MasterWithClock
Mcu.Package=LQFP100
PB9.Signal=GPIO_Input
PB1.Signal=GPIO_Output
PC3_C.GPIO_PuPd=GPIO_PULLUP
NVIC.TimeBase=TIM1_UP_IRQn
Dma.SAI3_A.0.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
RCC.PLL3FRACN=0
SH.GPXTI8.0=GPIO_EXTI8
PD12.Signal=SAI2_FS_A
PC3_C.GPIO_Label=DIPSWITCH_CFG3
NVIC.TimeBaseIP=TIM1
PA10.Signal=GPIO_Input
PB9.GPIO_PuPd=GPIO_NOPULL
FREERTOS.FootprintOK=true
PE12.GPIO_Label=DIPSWITCH1
PC14-OSC32_IN\ (OSC32_IN).Mode=LSE-External-Oscillator
SAI2.DataSize-SAI_A_AsyncSlave=SAI_DATASIZE_16
Dma.UART5_TX.3.EventEnable=DISABLE
RCC.LPUART1Freq_Value=120000000
PB0.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
USB_OTG_FS.IPParameters=VirtualMode,battery_charging_enable
PB13.Mode=Asynchronous
PE6.Locked=true
PD3.GPIO_PuPd=GPIO_NOPULL
NVIC.DMA1_Stream6_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
PD15.Signal=SAI3_MCLK_A
RCC.VCO3OutputFreq_Value=196608000
PC8.GPIO_Mode=GPIO_MODE_INPUT
PB5.GPIO_Mode=GPIO_MODE_INPUT
SH.GPXTI10.0=GPIO_EXTI10
PD6.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
FATFS0.BSP.STBoard=false
ProjectManager.ProjectFileName=HELIKE_STM32H750.ioc
FREERTOS.Tasks01=defaultTask,24,128,StartDefaultTask,Default,NULL,Dynamic,NULL,NULL;system,24,128,SYSTEM_Task,As external,NULL,Dynamic,NULL,NULL
Dma.USART2_TX.5.SyncEnable=DISABLE
Dma.SAI3_B.1.Priority=DMA_PRIORITY_HIGH
Mcu.PinsNb=76
PC14-OSC32_IN\ (OSC32_IN).GPIOParameters=GPIO_Label
PC11.Locked=true
Mcu.Pin73=VP_FATFS_VS_SDIO
Mcu.Pin74=VP_FREERTOS_VS_CMSIS_V2
Mcu.Pin71=PE1
Mcu.Pin72=VP_CRC_VS_CRC
Mcu.Pin75=VP_SYS_VS_tim1
PC13.Signal=GPIO_Input
FATFS0.BSP.mode=Input
PD3.Signal=GPIO_Input
Mcu.Pin70=PB9
Mcu.Pin68=PB7
Mcu.Pin69=PB8
Dma.UART5_RX.2.EventEnable=DISABLE
Mcu.Pin62=PD6
Mcu.Pin63=PD7
Mcu.Pin60=PD4
Mcu.Pin61=PD5
Mcu.Pin66=PB5
Mcu.Pin67=PB6
Mcu.Pin64=PB3 (JTDO/TRACESWO)
Mcu.Pin65=PB4 (NJTRST)
Dma.SAI3_A.0.SyncRequestNumber=1
RCC.D1CPREFreq_Value=480000000
PA3.Mode=Asynchronous
PB8.GPIO_Label=TP3
RCC.Tim1OutputFreq_Value=240000000
PA8.GPIO_Label=SPARE2
SAI3.Instance-SAI_A_MasterWithClock=SAI$Index_Block_A
Mcu.Pin59=PD3
Mcu.Pin57=PD1
Mcu.Pin58=PD2
Mcu.Pin51=PA14 (JTCK/SWCLK)
Mcu.Pin52=PA15 (JTDI)
Mcu.Pin50=PA13 (JTMS/SWDIO)
Mcu.Pin55=PC12
Mcu.Pin56=PD0
Mcu.Pin53=PC10
PE8.GPIO_Label=JOYSTICK_SOUTH
Mcu.Pin54=PC11
Dma.UART5_RX.2.RequestNumber=1
PB9.Locked=true
Mcu.Pin48=PA11
Mcu.Pin49=PA12
Mcu.Pin46=PA9
Mcu.Pin47=PA10
PB14.Signal=SDMMC2_D0
PE2.GPIO_PuPd=GPIO_NOPULL
Mcu.Pin40=PD15
Mcu.Pin41=PC6
PE13.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
Mcu.Pin44=PC9
Mcu.Pin45=PA8
Mcu.Pin42=PC7
Mcu.Pin43=PC8
SAI3.RealAudioFreq-SAI_A_MasterWithClock=48.0 KHz
PE1.GPIO_Label=TP1
PD1.Mode=SAI_A_MasterWithClock
PC2_C.GPIO_Label=DIPSWITCH_CFG4
RCC.AHB12Freq_Value=240000000
PE14.Signal=GPIO_Input
Mcu.Pin37=PD12
Mcu.Pin38=PD13
Mcu.Pin35=PD9
Mcu.Pin36=PD11
Dma.SAI2_A.6.SyncEnable=DISABLE
Mcu.Pin39=PD14
Dma.USART2_TX.5.PeriphInc=DMA_PINC_DISABLE
Mcu.Pin30=PB11
PC9.GPIO_PuPd=GPIO_NOPULL
Mcu.Pin33=PB14
PE3.GPIO_PuPd=GPIO_NOPULL
Mcu.Pin34=PB15
Mcu.Pin31=PB12
Mcu.Pin32=PB13
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PC10.GPIOParameters=GPIO_Label
PC9.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
Mcu.Pin26=PE13
Mcu.Pin27=PE14
Mcu.Pin24=PE11
Mcu.Pin25=PE12
CORTEX_M7.IPParameters=CPU_ICache,CPU_DCache,MPU_Control,Enable-Cortex_Memory_Protection_Unit_Region0_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region0_Settings,Size-Cortex_Memory_Protection_Unit_Region0_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region0_Settings
PC7.GPIO_Label=TP29
Mcu.Pin28=PE15
Mcu.Pin29=PB10
PC8.GPIO_PuPd=GPIO_NOPULL
PD14.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
Mcu.Pin22=PE9
Mcu.Pin23=PE10
Mcu.Pin20=PE7
Mcu.Pin21=PE8
Dma.SAI3_B.1.Mode=DMA_CIRCULAR
PC14-OSC32_IN\ (OSC32_IN).GPIO_Label=TP12
PA10.Locked=true
NVIC.ForceEnableDMAVector=true
PB5.GPIO_PuPd=GPIO_NOPULL
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PE5.GPIO_Label=LED4
PC12.GPIO_Label=TP8
ProjectManager.HeapSize=0x200
Mcu.Pin15=PC4
Dma.UART5_RX.2.Mode=DMA_CIRCULAR
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Mcu.Pin16=PC5
Mcu.Pin13=PA1
Mcu.Pin14=PA3
Mcu.Pin19=PB2
Mcu.Pin17=PB0
Mcu.Pin18=PB1
Dma.SAI2_A.6.Instance=DMA1_Stream6
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
SAI3.Instance-SAI_B_SyncSlave=SAI$Index_Block_B
Mcu.Pin11=PC2_C
Dma.UART5_RX.2.Direction=DMA_PERIPH_TO_MEMORY
Mcu.Pin12=PC3_C
PC5.GPIO_Speed=GPIO_SPEED_FREQ_LOW
Mcu.Pin10=PC1
SH.GPXTI10.ConfNb=1
PE3.Signal=GPIO_Output
PE4.PinState=GPIO_PIN_RESET
SAI3.VirtualSlotActive-SAI_B_SyncSlave=SAI_SLOTACTIVE_ALL
PB1.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PD2.Signal=GPIO_Input
PD14.GPIO_Mode=GPIO_MODE_INPUT
Dma.SAI2_A.6.FIFOMode=DMA_FIFOMODE_DISABLE
FATFS0.BSP.name=Detect_SDIO
PC1.Mode=SD_4_bits_Wide_bus
Mcu.Family=STM32H7
ProjectManager.MainLocation=Core/Src
Dma.UART5_RX.2.Instance=DMA1_Stream4
ProjectManager.TemplateDestinationPath=C\:\\Users\\embed\\STM32CubeIDE\\workspace_1.3.0\\HELIKE_STM32H750
ProjectManager.KeepUserCode=true
FATFS0.BSP.semaphore=
PH0-OSC_IN\ (PH0).Signal=RCC_OSC_IN
PE11.GPIO_Label=JOYSTICK_CENTER
PC15-OSC32_OUT\ (OSC32_OUT).Mode=LSE-External-Oscillator
PC5.Locked=true
PE2.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PA11.Mode=Device_Only
PD6.Locked=true
PD2.GPIO_Mode=GPIO_MODE_INPUT
NVIC.TIM1_UP_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
RCC.PLL2FRACN=0
PD2.Locked=true
RCC.VCO2OutputFreq_Value=614400000
ProjectManager.TemplateSourcePath=C\:\\ST\\STM32CubeIDE_1.3.0\\STM32CubeIDE\\plugins\\com.st.stm32cube.common.mx_5.6.0.202002181639\\db\\extra_templates
PB15.Signal=SDMMC2_D1
Dma.SAI2_A.6.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
PD9.Mode=SAI_B_SyncSlave
Dma.UART5_TX.3.Direction=DMA_MEMORY_TO_PERIPH
PB5.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
PD13.Signal=SAI2_SCK_A
Mcu.IP4=FATFS
Mcu.IP5=FREERTOS
Mcu.IP2=DEBUG
Mcu.IP3=DMA
PC11.GPIO_PuPd=GPIO_PULLUP
Mcu.IP0=CORTEX_M7
Mcu.IP1=CRC
PE4.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
Dma.SAI3_B.1.PeriphInc=DMA_PINC_DISABLE
RCC.DIVP3Freq_Value=24576000
RCC.SDMMCFreq_Value=240000000
PB0.PinState=GPIO_PIN_RESET
PE11.GPIO_PuPd=GPIO_PULLUP
PB1.GPIO_PuPd=GPIO_NOPULL
ProjectManager.PreviousToolchain=SW4STM32
Dma.UART5_TX.3.FIFOMode=DMA_FIFOMODE_DISABLE
PA8.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
FREERTOS.IPParameters=Tasks01,configENABLE_FPU,configUSE_PREEMPTION,FootprintOK,configENABLE_BACKWARD_COMPATIBILITY,configUSE_TRACE_FACILITY
PE3.PinState=GPIO_PIN_RESET
PD5.Mode=Asynchronous
FREERTOS.configUSE_PREEMPTION=0
RCC.HRTIMFreq_Value=240000000
PH1-OSC_OUT\ (PH1).Mode=HSE-External-Oscillator
RCC.DIVR3Freq_Value=98304000
RCC.HSE_VALUE=12288000
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Mcu.IP10=SAI2
PE2.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
Mcu.IP12=SDMMC2
PE13.GPIO_PuPd=GPIO_PULLUP
Mcu.IP11=SAI3
FREERTOS.configENABLE_BACKWARD_COMPATIBILITY=0
PC4.GPIO_Speed=GPIO_SPEED_FREQ_LOW
RCC.DIVP1Freq_Value=480000000
Mcu.IP14=UART5
Mcu.IP13=SYS
Mcu.IP16=USB_OTG_FS
Mcu.IP15=USART2
Dma.SAI3_B.1.Instance=DMA1_Stream3
PE8.Locked=true
Dma.UART5_RX.2.Priority=DMA_PRIORITY_HIGH
PC11.GPIO_Label=DIPSWITCH_CFG2
Dma.USART2_TX.5.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
PC13.GPIO_PuPd=GPIO_NOPULL
PC7.GPIO_Mode=GPIO_MODE_INPUT
Dma.USART2_RX.4.SyncSignalID=NONE
PE3.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
Dma.SAI2_A.6.Direction=DMA_PERIPH_TO_MEMORY
PE3.Locked=true
PB7.Signal=I2C4_SDA
Dma.UART5_TX.3.Priority=DMA_PRIORITY_MEDIUM
Dma.USART2_TX.5.Priority=DMA_PRIORITY_MEDIUM
PB0.Locked=true
PB1.PinState=GPIO_PIN_RESET
Dma.USART2_RX.4.Priority=DMA_PRIORITY_HIGH
PD6.GPIO_Mode=GPIO_MODE_INPUT
PB12.Mode=Asynchronous
Dma.SAI2_A.6.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
ProjectManager.ToolChainLocation=
Dma.USART2_RX.4.MemInc=DMA_MINC_ENABLE
RCC.DIVR1Freq_Value=480000000
Dma.SAI3_A.0.SyncEnable=DISABLE
FATFS._FS_LOCK=1
PB5.GPIO_Label=TP4
SAI3.SlotActive-SAI_B_SyncSlave=0x0000FFFF
Dma.Request2=UART5_RX
Dma.Request1=SAI3_B
Dma.Request4=USART2_RX
Dma.Request3=UART5_TX
Dma.Request6=SAI2_A
Dma.Request5=USART2_TX
NVIC.DMA1_Stream0_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
PC5.Signal=GPIO_Output
PD3.GPIO_Label=TP6
PE14.GPIO_Mode=GPIO_MODE_INPUT
PE7.Signal=GPXTI7
PC4.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PD6.Signal=GPIO_Input
Dma.Request0=SAI3_A
PE2.GPIO_Label=LED1
PE12.Locked=true
Dma.UART5_RX.2.FIFOMode=DMA_FIFOMODE_DISABLE
PA3.Signal=USART2_RX
PB8.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
PE14.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
PC9.GPIO_Label=TP27
Dma.UART5_TX.3.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
PC11.Signal=GPIO_Input
PC8.Signal=GPIO_Input
ProjectManager.DefaultFWLocation=true
PE14.GPIO_Label=DIPSWITCH3
PD9.Signal=SAI3_SD_B
ProjectManager.DeletePrevious=true
SAI2.VirtualMode-SAI_A_AsyncSlave=VM_SLAVE
RCC.FamilyName=M
PH1-OSC_OUT\ (PH1).Signal=RCC_OSC_OUT
Dma.SAI3_B.1.SyncEnable=DISABLE
Dma.USART2_RX.4.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
PE15.GPIOParameters=GPIO_PuPd,GPIO_Label
PB9.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
PB0.GPIO_Speed=GPIO_SPEED_FREQ_LOW
FATFS0.BSP.instance=PA8
Dma.UART5_TX.3.Instance=DMA1_Stream5
FATFS.IPParameters=_USE_LFN,_FS_LOCK,_USE_MKFS
CORTEX_M7.MPU_Control=__NULL
PA9.Mode=Activate_VBUS
PC15-OSC32_OUT\ (OSC32_OUT).Signal=RCC_OSC32_OUT
PC9.GPIO_Mode=GPIO_MODE_INPUT
RCC.VCO1OutputFreq_Value=960000000
PC3_C.Locked=true
FREERTOS.configUSE_TRACE_FACILITY=0
PC5.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
Dma.SAI3_A.0.SignalID=NONE
RCC.AXIClockFreq_Value=240000000
PE2.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
RCC.USBFreq_Value=48000000
PA1.Signal=SAI2_MCLK_B
RCC.CKPERFreq_Value=64000000
Dma.USART2_RX.4.PeriphInc=DMA_PINC_DISABLE
Dma.USART2_TX.5.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.SAI3_B.1.FIFOMode=DMA_FIFOMODE_DISABLE
board=custom
PC2_C.GPIO_PuPd=GPIO_PULLUP
PB15.Mode=SD_4_bits_Wide_bus
MxCube.Version=5.6.0
RCC.FDCANFreq_Value=240000000
RCC.ADCFreq_Value=61440000
PA10.GPIOParameters=GPIO_Label
PE5.Locked=true
PE14.GPIO_PuPd=GPIO_PULLUP
PA15\ (JTDI).GPIO_Label=TP10
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CECFreq_Value,CKPERFreq_Value,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,D1PPRE,D2PPRE1,D2PPRE2,D3PPRE,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVM2,DIVM3,DIVN1,DIVN2,DIVN3,DIVP1Freq_Value,DIVP2,DIVP2Freq_Value,DIVP3,DIVP3Freq_Value,DIVQ1,DIVQ1Freq_Value,DIVQ2,DIVQ2Freq_Value,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3Freq_Value,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HPRE,HRTIMFreq_Value,HSE_VALUE,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLL2FRACN,PLL3FRACN,PLLFRACN,PLLSourceVirtual,QSPIFreq_Value,RNGFreq_Value,RTCFreq_Value,SAI1Freq_Value,SAI23CLockSelection,SAI23Freq_Value,SAI4AFreq_Value,SAI4BFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBCLockSelection,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
ProjectManager.AskForMigrate=true
PE7.GPIO_Label=JOYSTICK_NORTH
PE12.GPIO_Mode=GPIO_MODE_INPUT
PE12.Signal=GPIO_Input
PB2.Locked=true
Mcu.IP8=NVIC
Mcu.IP9=RCC
Mcu.IP6=I2C2
Mcu.IP7=I2C4
ProjectManager.CoupleFile=true
RCC.SYSCLKFreq_VALUE=480000000
NVIC.SDMMC2_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
RCC.I2C123Freq_Value=120000000
PA1.Locked=true
KeepUserPlacement=false
PC15-OSC32_OUT\ (OSC32_OUT).GPIO_Label=TP13
Dma.UART5_TX.3.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
SH.GPXTI9.ConfNb=1
NVIC.EXTI9_5_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
PB2.GPIO_Label=SPARE3
PE15.GPIO_PuPd=GPIO_PULLUP
PE5.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PD11.Mode=SAI_A_AsyncSlave
PC6.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
PD3.GPIO_Mode=GPIO_MODE_INPUT
NVIC.I2C2_EV_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
PA8.GPIO_PuPd=GPIO_NOPULL
PC3_C.Signal=GPIO_Input
Dma.UART5_TX.3.RequestNumber=1
PE5.GPIO_Speed=GPIO_SPEED_FREQ_LOW
NVIC.FPU_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:false
NVIC.DMA1_Stream3_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
PC8.Locked=true
CORTEX_M7.CPU_DCache=Enabled
Dma.USART2_TX.5.SyncSignalID=NONE
VP_CRC_VS_CRC.Mode=CRC_Activate
Dma.UART5_RX.2.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.UART5_RX.2.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
PB12.Signal=UART5_RX
PB0.GPIO_PuPd=GPIO_NOPULL
SAI2.VirtualSlotActive-SAI_A_AsyncSlave=SAI_SLOTACTIVE_ALL
PE1.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
SAI2.IPParameters=Instance-SAI_A_AsyncSlave,VirtualMode-SAI_A_AsyncSlave,FrameLength-SAI_A_AsyncSlave,DataSize-SAI_A_AsyncSlave,SlotNumber-SAI_A_AsyncSlave,VirtualSlotActive-SAI_A_AsyncSlave,SlotActive-SAI_A_AsyncSlave
PD6.GPIO_PuPd=GPIO_NOPULL
Dma.SAI3_B.1.MemInc=DMA_MINC_ENABLE
Dma.SAI3_B.1.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
PB4\ (NJTRST).Signal=SDMMC2_D3
PE4.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PB10.Mode=I2C
PA8.GPIO_Mode=GPIO_MODE_INPUT
VP_FATFS_VS_SDIO.Mode=SDIO
PC12.Locked=true
SH.GPXTI9.0=GPIO_EXTI9
NVIC.DMA1_Stream2_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
PC12.Signal=GPIO_Input
PE8.GPIO_PuPd=GPIO_PULLUP
PD3.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
Dma.USART2_TX.5.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.USART2_TX.5.EventEnable=DISABLE
PC6.GPIO_Label=SPARE5
Dma.USART2_RX.4.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
PB13.Signal=UART5_TX
PD6.GPIO_Label=TP5
Dma.USART2_RX.4.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
PinOutPanel.RotationAngle=0
PE6.GPIO_Label=TP11
RCC.MCO1PinFreq_Value=64000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.AHB4Freq_Value=240000000
SAI3.FrameLength-SAI_B_SyncSlave=32
SAI3.DataSize-SAI_A_MasterWithClock=SAI_DATASIZE_16
Dma.UART5_TX.3.Polarity=HAL_DMAMUX_REQ_GEN_RISING
PA14\ (JTCK/SWCLK).Signal=DEBUG_JTCK-SWCLK
SAI3.AudioMode-SAI_B_SyncSlave=SAI_MODESLAVE_TX
Dma.UART5_TX.3.MemInc=DMA_MINC_ENABLE
Dma.SAI3_A.0.PeriphInc=DMA_PINC_DISABLE
VP_FATFS_VS_SDIO.Signal=FATFS_VS_SDIO
Dma.SAI2_A.6.Priority=DMA_PRIORITY_HIGH
I2C4.Timing=0x307075B1
SAI3.VirtualSlotActive-SAI_A_MasterWithClock=SAI_SLOTACTIVE_ALL
PD4.Signal=SAI3_FS_A
RCC.DIVQ3Freq_Value=98304000
PB6.Mode=I2C
PE10.Locked=true
PE5.Signal=GPIO_Output
Dma.SAI2_A.6.RequestNumber=1
Dma.SAI2_A.6.SyncSignalID=NONE
PB2.Signal=GPIO_Input
Dma.UART5_RX.2.SyncRequestNumber=1
FATFS0.BSP.i2caddr=0
RCC.DIVM3=1
RCC.DIVM2=1
RCC.DIVM1=1
SH.GPXTI7.0=GPIO_EXTI7
MxDb.Version=DB.5.0.60
