usound-tech/helike/HELIKE_STM32H750.ioc
PB0.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PE15.Locked=true
PE5.PinState=GPIO_PIN_RESET
Dma.USART2_RX.4.EventEnable=DISABLE
FATFS._USE_MKFS=0
PE2.Signal=GPIO_Output
PA14\ (JTCK/SWCLK).Mode=Serial_Wire
SH.GPXTI11.ConfNb=1
NVIC.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
RCC.DIVR2Freq_Value=307200000
PE10.Signal=GPXTI10
RCC.SAI23CLockSelection=RCC_SAI23CLKSOURCE_PLL3
RCC.MCO2PinFreq_Value=480000000
PC8.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
SH.GPXTI11.0=GPIO_EXTI11
Dma.SAI3_B.1.RequestNumber=1
Dma.SAI3_B.1.SyncRequestNumber=1
PE10.GPIOParameters=GPIO_PuPd,GPIO_Label
FATFS0.BSP.solution=PA8
SH.GPXTI8.ConfNb=1
PC6.GPIO_PuPd=GPIO_NOPULL
RCC.DFSDMFreq_Value=120000000
RCC.TraceFreq_Value=480000000
PD4.Mode=SAI_A_MasterWithClock
RCC.APB4Freq_Value=120000000
RCC.CECFreq_Value=32000
RCC.SAI23Freq_Value=24576000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PC12.GPIO_PuPd=GPIO_NOPULL
PE10.GPIO_Label=JOYSTICK_EAST
SAI2.SlotActive-SAI_A_AsyncSlave=0x0000FFFF
PH0-OSC_IN\ (PH0).Mode=HSE-External-Oscillator
ProjectManager.CustomerFirmwarePackage=
PC4.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PE12.GPIO_PuPd=GPIO_PULLUP
RCC.DIVQ2=20
RCC.DIVQ1=4
PC4.PinState=GPIO_PIN_RESET
PD2.GPIO_PuPd=GPIO_NOPULL
Dma.SAI3_B.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
RCC.SWPMI1Freq_Value=120000000
RCC.DIVP3=8
PB8.GPIO_PuPd=GPIO_NOPULL
ProjectManager.UseDefaultSourcePath=true
PC6.Signal=GPIO_Input
PD7.Signal=SDMMC2_CMD
PD1.Signal=SAI3_SD_A
PE1.GPIO_PuPd=GPIO_NOPULL
RCC.DIVP2=10
Dma.SAI3_B.1.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.USART2_RX.4.RequestNumber=1
PC11.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
RCC.QSPIFreq_Value=240000000
Dma.UART5_RX.2.MemInc=DMA_MINC_ENABLE
Dma.SAI2_A.6.MemInc=DMA_MINC_ENABLE
RCC.USART234578Freq_Value=120000000
SAI3.ClockStrobing-SAI_A_MasterWithClock=SAI_CLOCKSTROBING_FALLINGEDGE
RCC.SPI123Freq_Value=240000000
PB11.Mode=I2C
PC3_C.GPIOParameters=GPIO_PuPd,GPIO_Label
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
PC6.Locked=true
PA9.Signal=USB_OTG_FS_VBUS
RCC.DIVN3=16
RCC.DIVN2=50
RCC.DIVN1=78
PB5.Locked=true
CORTEX_M7.BaseAddress-Cortex_Memory_Protection_Unit_Region0_Settings=0x20000
PC7.GPIO_PuPd=GPIO_NOPULL
PE9.GPIO_Label=JOYSTICK_WEST
PB10.Signal=I2C2_SCL
Dma.SAI3_A.0.EventEnable=DISABLE
FATFS.BSP.number=1
RCC.USBCLockSelection=RCC_USBCLKSOURCE_HSI48
ProjectManager.LastFirmware=true
PE15.Signal=GPIO_Input
Dma.SAI3_B.1.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
Dma.SAI3_A.0.MemInc=DMA_MINC_ENABLE
PE8.Signal=GPXTI8
VP_SYS_VS_tim1.Signal=SYS_VS_tim1
Dma.UART5_RX.2.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
FATFS0.BSP.i2creg=
RCC.RNGFreq_Value=48000000
PC11.GPIO_Mode=GPIO_MODE_INPUT
CORTEX_M7.AccessPermission-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_FULL_ACCESS
Dma.USART2_TX.5.FIFOMode=DMA_FIFOMODE_DISABLE
PC6.GPIO_Mode=GPIO_MODE_INPUT
PB4\ (NJTRST).Mode=SD_4_bits_Wide_bus
PE7.Locked=true
ProjectManager.FreePins=true
RCC.LPTIM2Freq_Value=120000000
Dma.SAI2_A.6.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
SDMMC2.ClockDiv=10
ProjectManager.UnderRoot=true
PE13.Locked=true
PE4.GPIO_PuPd=GPIO_NOPULL
Dma.SAI3_A.0.SyncSignalID=NONE
PC12.GPIO_Mode=GPIO_MODE_INPUT
PB5.Signal=GPIO_Input
PD12.Mode=SAI_A_AsyncSlave
PE13.GPIO_Label=DIPSWITCH2
Dma.USART2_RX.4.MemDataAlignment=DMA_MDATAALIGN_BYTE
PE3.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PE3.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PD11.Signal=SAI2_SD_A
Dma.USART2_TX.5.Instance=DMA1_Stream1
ProjectManager.CompilerOptimize=6
PA11.Signal=USB_OTG_FS_DM
RCC.LPTIM345Freq_Value=120000000
ProjectManager.ComputerToolchain=false
RCC.LTDCFreq_Value=98304000
PB3\ (JTDO/TRACESWO).Mode=SD_4_bits_Wide_bus
PE2.Locked=true
Dma.SAI3_B.1.SignalID=NONE
Dma.USART2_RX.4.Mode=DMA_CIRCULAR
PE12.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
RCC.HCLK3ClockFreq_Value=240000000
PB0.Signal=GPIO_Output
Dma.USART2_RX.4.Polarity=HAL_DMAMUX_REQ_GEN_RISING
PC1.Signal=SDMMC2_CK
PD2.GPIO_Label=TP7
PA13\ (JTMS/SWDIO).Signal=DEBUG_JTMS-SWDIO
SAI3.SlotActive-SAI_A_MasterWithClock=0x0000FFFF
RCC.DIVQ2Freq_Value=30720000
I2C2.IPParameters=Timing
PE7.GPIO_PuPd=GPIO_PULLUP
RCC.SAI1Freq_Value=240000000
RCC.CortexFreq_Value=480000000
Mcu.UserName=STM32H750VBTx
RCC.HPRE=RCC_HCLK_DIV2
PC10.Locked=true
Dma.USART2_TX.5.MemInc=DMA_MINC_ENABLE
PC10.Signal=GPIO_Input
I2C2.Timing=0x307075B1
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true,5-MX_I2C2_Init-I2C2-false-HAL-true,6-MX_I2C4_Init-I2C4-false-HAL-true,7-MX_SAI2_Init-SAI2-false-HAL-true,8-MX_SDMMC2_SD_Init-SDMMC2-false-HAL-true,9-MX_USART2_UART_Init-USART2-false-HAL-true,10-MX_USB_OTG_FS_PCD_Init-USB_OTG_FS-false-HAL-true,11-MX_SAI3_Init-SAI3-false-HAL-true,12-MX_SPI1_Init-SPI1-false-HAL-true,12-MX_UART5_Init-UART5-false-HAL-true,13-MX_FATFS_Init-FATFS-false-HAL-false
PC9.Locked=true
PB0.GPIO_Label=nDAC1_Powerdown
Dma.USART2_RX.4.Instance=DMA1_Stream0
PC13.GPIO_Label=SPARE4
PB11.Signal=I2C2_SDA
NVIC.DMA1_Stream4_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
PE5.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
ProjectManager.StackSize=0x400
VP_FREERTOS_VS_CMSIS_V2.Mode=CMSIS_V2
NVIC.UART5_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
RCC.VCOInput3Freq_Value=12288000
PA12.Signal=USB_OTG_FS_DP
Mcu.UserConstants=
USB_OTG_FS.battery_charging_enable=DISABLE
PE5.GPIO_PuPd=GPIO_NOPULL
Dma.SAI3_B.1.EventEnable=DISABLE
Mcu.ThirdPartyNb=0
PE1.GPIO_Mode=GPIO_MODE_INPUT
RCC.HCLKFreq_Value=240000000
Mcu.IPNb=17
Dma.USART2_RX.4.SignalID=NONE
Dma.UART5_RX.2.SignalID=NONE
RCC.SPDIFRXFreq_Value=240000000
Mcu.Pin6=PC14-OSC32_IN (OSC32_IN)
Mcu.Pin7=PC15-OSC32_OUT (OSC32_OUT)
Mcu.Pin8=PH0-OSC_IN (PH0)
Mcu.Pin9=PH1-OSC_OUT (PH1)
PC2_C.Signal=GPIO_Input
Mcu.Pin0=PE2
Mcu.Pin1=PE3
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PE4
Mcu.Pin3=PE5
Mcu.Pin4=PE6
SAI3.IPParameters=Instance-SAI_A_MasterWithClock,VirtualMode-SAI_A_MasterWithClock,MClockEnable-SAI_A_MasterWithClock,RealAudioFreq-SAI_A_MasterWithClock,ErrorAudioFreq-SAI_A_MasterWithClock,Instance-SAI_B_SyncSlave,VirtualMode-SAI_B_SyncSlave,FrameLength-SAI_A_MasterWithClock,FrameLength-SAI_B_SyncSlave,DataSize-SAI_A_MasterWithClock,VirtualSlotActive-SAI_A_MasterWithClock,SlotActive-SAI_A_MasterWithClock,SlotNumber-SAI_A_MasterWithClock,AudioFrequency-SAI_A_MasterWithClock,ClockStrobing-SAI_A_MasterWithClock,AudioMode-SAI_B_SyncSlave,DataSize-SAI_B_SyncSlave,SlotNumber-SAI_B_SyncSlave,VirtualSlotActive-SAI_B_SyncSlave,SlotActive-SAI_B_SyncSlave,ClockStrobing-SAI_B_SyncSlave
Mcu.Pin5=PC13
USART2.VirtualMode-Asynchronous=VM_ASYNC
PE13.Signal=GPIO_Input
Dma.SAI3_A.0.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
Dma.USART2_RX.4.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.USART2_TX.5.SignalID=NONE
PE4.GPIO_Speed=GPIO_SPEED_FREQ_LOW
VP_SYS_VS_tim1.Mode=TIM1
File.Version=6
PA10.GPIO_Label=SPARE1
Dma.USART2_RX.4.SyncRequestNumber=1
SAI3.SlotNumber-SAI_A_MasterWithClock=2
Dma.SAI3_B.1.Polarity=HAL_DMAMUX_REQ_GEN_RISING
PB8.Locked=true
SAI3.ClockStrobing-SAI_B_SyncSlave=SAI_CLOCKSTROBING_FALLINGEDGE
PE4.Signal=GPIO_Output
PE6.GPIOParameters=GPIO_Label
Dma.RequestsNb=7
Dma.UART5_RX.2.PeriphInc=DMA_PINC_DISABLE
PC2_C.Locked=true
ProjectManager.ProjectName=HELIKE_STM32H750
RCC.APB3Freq_Value=120000000
SAI3.SlotNumber-SAI_B_SyncSlave=2
Dma.UART5_TX.3.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
RCC.D1PPRE=RCC_APB3_DIV2
PD14.Locked=true
USB_OTG_FS.VirtualMode=Device_Only
Dma.SAI3_A.0.Mode=DMA_CIRCULAR
Dma.SAI2_A.6.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.USART2_TX.5.SyncRequestNumber=1
Dma.UART5_RX.2.SyncEnable=DISABLE
PC4.Locked=true
Dma.USART2_TX.5.Direction=DMA_MEMORY_TO_PERIPH
Dma.SAI2_A.6.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
Dma.SAI3_A.0.Instance=DMA1_Stream2
Dma.SAI3_A.0.FIFOMode=DMA_FIFOMODE_DISABLE
RCC.Tim2OutputFreq_Value=240000000
RCC.DFSDMACLkFreq_Value=240000000
Dma.UART5_TX.3.Mode=DMA_NORMAL
Dma.UART5_TX.3.SignalID=NONE
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
PE8.GPIOParameters=GPIO_PuPd,GPIO_Label
CORTEX_M7.CPU_ICache=Enabled
PA13\ (JTMS/SWDIO).Mode=Serial_Wire
PB9.GPIO_Label=TP2
PC10.GPIO_Label=TP9
Dma.UART5_RX.2.Polarity=HAL_DMAMUX_REQ_GEN_RISING
ProjectManager.NoMain=false
PE2.PinState=GPIO_PIN_RESET
PC4.GPIO_PuPd=GPIO_NOPULL
SAI3.AudioFrequency-SAI_A_MasterWithClock=SAI_AUDIO_FREQUENCY_48K
RCC.SAI4BFreq_Value=240000000
PC4.Signal=GPIO_Output
RCC.D2PPRE2=RCC_APB2_DIV2
RCC.D2PPRE1=RCC_APB1_DIV2
SAI2.FrameLength-SAI_A_AsyncSlave=32
PD5.Signal=USART2_TX
NVIC.DMA1_Stream1_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
SAI3.FrameLength-SAI_A_MasterWithClock=32
PC5.GPIO_PuPd=GPIO_NOPULL
Dma.UART5_TX.3.SyncSignalID=NONE
NVIC.USART2_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
PE9.GPIOParameters=GPIO_PuPd,GPIO_Label
RCC.SPI6Freq_Value=120000000
PC12.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
PC8.GPIO_Label=TP28
RCC.SPI45Freq_Value=120000000
PE15.GPIO_Label=DIPSWITCH4
PB3\ (JTDO/TRACESWO).Signal=SDMMC2_D2
ProjectManager.TargetToolchain=SW4STM32
NVIC.DMA1_Stream5_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
PE7.GPIOParameters=GPIO_PuPd,GPIO_Label
FATFS0.BSP.condition=
SAI3.MClockEnable-SAI_A_MasterWithClock=SAI_MASTERCLOCK_ENABLE
PB2.GPIOParameters=GPIO_Label
PD13.Mode=SAI_A_AsyncSlave
PC15-OSC32_OUT\ (OSC32_OUT).GPIOParameters=GPIO_Label
PE4.Locked=true
PE11.Signal=GPXTI11
PD3.Locked=true
Dma.SAI2_A.6.PeriphInc=DMA_PINC_DISABLE
PB1.Locked=true
Dma.SAI3_A.0.Priority=DMA_PRIORITY_HIGH
SAI2.Instance-SAI_A_AsyncSlave=SAI$Index_Block_A
Dma.SAI2_A.6.Mode=DMA_CIRCULAR
PB9.GPIO_Mode=GPIO_MODE_INPUT
RCC.VCOInput1Freq_Value=12288000
Dma.USART2_RX.4.SyncEnable=DISABLE
Dma.USART2_RX.4.Direction=DMA_PERIPH_TO_MEMORY
Dma.SAI3_A.0.RequestNumber=1
RCC.APB2Freq_Value=120000000
PC13.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
Dma.SAI3_A.0.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
PD14.GPIO_Label=DIPSWITCH_CFG1
SAI3.VirtualMode-SAI_A_MasterWithClock=VM_MASTER
PE6.Signal=GPIO_Input
PE11.Locked=true
Mcu.Name=STM32H750VBTx
PD0.Mode=SAI_A_MasterWithClock
CORTEX_M7.Size-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_SIZE_32KB
Dma.USART2_TX.5.RequestNumber=1
VP_FREERTOS_VS_CMSIS_V2.Signal=FREERTOS_VS_CMSIS_V2
PD14.Signal=GPIO_Input
Dma.SAI3_B.1.Direction=DMA_MEMORY_TO_PERIPH
PC5.PinState=GPIO_PIN_RESET
PA12.Mode=Device_Only
Dma.UART5_RX.2.SyncSignalID=NONE
PC14-OSC32_IN\ (OSC32_IN).Signal=RCC_OSC32_IN
PC5.GPIO_Label=nAMP1_Powerdown
Dma.UART5_TX.3.PeriphInc=DMA_PINC_DISABLE
PB7.Mode=I2C
ProjectManager.UseDefaultDestinationPath=true
RCC.SAI4AFreq_Value=240000000
FATFS0.BSP.component=
RCC.DIVQ1Freq_Value=240000000
PC2_C.GPIOParameters=GPIO_PuPd,GPIO_Label
PB8.Signal=GPIO_Input
PE3.GPIO_Label=LED2
RCC.D3PPRE=RCC_APB4_DIV2
PC9.Signal=GPIO_Input
PA15\ (JTDI).Locked=true
PB8.GPIO_Mode=GPIO_MODE_INPUT
RCC.VCOInput2Freq_Value=12288000
RCC.APB1Freq_Value=120000000
PC5.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
ProjectManager.DeviceId=STM32H750VBTx
ProjectManager.LibraryCopy=1
I2C4.IPParameters=Timing
PB1.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PE9.GPIO_PuPd=GPIO_PULLUP
